; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph3 - mode
	thermograph1 - mode
	image0 - mode
	spectrograph2 - mode
	Star0 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation2 - direction
	Star6 - direction
	Star1 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph3)
	(supports instrument1 spectrograph2)
	(supports instrument1 image0)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
)
(:goal (and
	(have_image Planet9 thermograph3)
	(have_image Planet10 image0)
	(have_image Phenomenon11 image0)
	(have_image Planet12 spectrograph2)
	(have_image Phenomenon13 thermograph3)
	(have_image Planet14 thermograph3)
	(have_image Phenomenon15 thermograph1)
	(have_image Planet16 thermograph3)
	(have_image Phenomenon17 thermograph3)
))

)

; plan
1. (turn_to satellite0 star1 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star1)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 planet10 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet10)
   goals met: 0 of 9
5. (take_image satellite0 planet10 instrument0 image0)
   added: (have_image planet10 image0)
   goals met: 1 of 9
6. (turn_to satellite0 phenomenon15 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 9
7. (take_image satellite0 phenomenon15 instrument0 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon11 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon11 instrument0 image0)
   added: (have_image phenomenon11 image0)
   goals met: 3 of 9
10. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 9
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 9
12. (turn_to satellite0 groundstation2 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation2)
   goals met: 3 of 9
13. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 3 of 9
14. (turn_to satellite0 phenomenon13 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 9
15. (take_image satellite0 phenomenon13 instrument1 thermograph3)
   added: (have_image phenomenon13 thermograph3)
   goals met: 4 of 9
16. (turn_to satellite0 phenomenon17 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon17)
   goals met: 4 of 9
17. (take_image satellite0 phenomenon17 instrument1 thermograph3)
   added: (have_image phenomenon17 thermograph3)
   goals met: 5 of 9
18. (turn_to satellite0 planet12 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet12)
   goals met: 5 of 9
19. (take_image satellite0 planet12 instrument1 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 6 of 9
20. (turn_to satellite0 planet14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet14)
   goals met: 6 of 9
21. (take_image satellite0 planet14 instrument1 thermograph3)
   added: (have_image planet14 thermograph3)
   goals met: 7 of 9
22. (turn_to satellite0 planet16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet16)
   goals met: 7 of 9
23. (take_image satellite0 planet16 instrument1 thermograph3)
   added: (have_image planet16 thermograph3)
   goals met: 8 of 9
24. (turn_to satellite0 planet9 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet9)
   goals met: 8 of 9
25. (take_image satellite0 planet9 instrument1 thermograph3)
   added: (have_image planet9 thermograph3)
   goals met: 9 of 9
